{
  "id": "ALONZO_CHURCH",
  "title": "Alonzo Church (1903-1995)",
  "content": "Alonzo Church war ein US-amerikanischer Mathematiker und Logiker, der durch seine Arbeit in den Bereichen mathematische Logik und theoretische Informatik bekannt wurde. Zusammen mit Alan Turing entwickelte er die Church-Turing-These, die Aussagen über die Fähigkeit einer Rechenmaschine trifft.\n\nBiographie:\n1903: Geboren am 14. Juni 1903 in Washington, D.C., USA\n1924: Abschluss des Mathematikstudiums an der Princeton University in New Jersey (USA)\n1927: Erhalt des Doktortitels für seine Dissertation zum Thema 'Alternatives to Zermelo's Assumption'\n1928: National Research Fellow an der Harvard University sowie an den Universitäten in Göttingen und Amsterdam.\n1929: Ernennung zum 'Assistant Professor of Mathematics' an der Princeton University\n1930er: Entwicklung des Lambda Kalküls, einer formalen Notation zur Darstellung von Funktionen, die die Grundlage für funktionale ProgrammingLanguages bildet\n1936: Formulierung des Church Theorems. Church's Theorem besagt, dass es keine allgemeine Methode gibt, um vorherzusagen, ob ein bestimmter Rechenschritt im Lambda-Kalkül immer zu einem Ergebnis führt oder ob er in einer endlosen Schleife verbleibt.\n1936: Formulierung der Church These. Die Church These besagt, dass jede mathematisch berechenbare Funktion durch das Lambda-Kalkül dargestellt werden kann\n1936: Übertragung der Church-These auf die von Alan Turing entwickelte Turing-Maschine ('Church-Turing-These')\n1939: Beförderung zum 'Associate Professor'\n1941: Veröffentlichung seines Buches 'The Calculi of Lambda-Conversion' als Zusammenfassung über die Grundlagen und die Anwendung des Lambda Kalküls\n1947: Beförderung zum 'Professor'\n1956: Veröffentlichung seines Buches 'Introduction to Mathematical Logic', welches die Grundlagen der mathematischen Logik behandelt\n1961: Ernennung zum 'Professor of Mathematics and Philosophy'\n1967: Eintritt in den Ruhestand und anschließender Wechsel zur University of California in Los Angeles (USA). Dort arbeitete er als 'Kent Professor of Philosophy' und 'Professor of Mathematics'\n1990: Erneuter Eintritt in den Ruhestand\n1995: Gestorben am 11. August 1995 in Hudson, Ohio, USA\n\nQuellen:\nhttps://mathshistory.st-andrews.ac.uk/Biographies/Church/\nhttps://www.britannica.com/biography/Alonzo-Church\n",
  "image": "Alonzo_Church.jpeg",
  "connections": ["ALAN_TURING", "CHURCH_TURING_THESIS", "CHURCH_THESIS", "CHURCH_THEOREM", "LAMBDA_CALCULUS"]
}