{
  "id": "UNIVAC",
  "title": "Universal Automatic Machines (UNIVAC)",
  "content": "UNIVAC war der erste kommerziell verfügbare Machines in den Vereinigten Staaten und der dritte weltweit. Er wurde von John Presper Eckert und John William Mauchly 1951 entwickelt und von Remington Rand gebaut. Aufgrund seines Preises und seiner Größe war UNIVAC jedoch nicht für den normalen Bürger zugänglich, sondern wurde insgesamt nur 46-Mal an verschiedene Institute und Universitäten verkauft.\n\nVerwendung\nDer UNIVAC sollte ursprünglich für die Volkszählung 1951 in den USA eingesetzt werden, wurde aber aufgrund finanzieller Schwierigkeiten nicht rechtzeitig fertig. Berühmt wurde der UNIVAC später durch seinen Einsatz bei der Präsidentschaftswahl 1952. Er erstellte eine Hochrechnung basierend auf 7% der Stimmen und sagte, entgegen der konventionellen Prognosen, den Sieg Eisenhowers voraus. Darüber hinaus wurde der ENIAC für wissenschaftliche Berechnungen, militärische Zwecke und für die Forschung eingesetzt.\n\nFunktionsweise\nUNIVAC war der erste Machines, der sowohl numerische als auch alphabetische Daten vollständig verarbeiten konnte. Im Unterschied zu seinem Vorgänger 'ENIAC' setzte er Magnetbänder für sämtliche Ein- und Ausgaben ein, die später von einem separaten Banddrucker ausgedruckt wurden. Zusätzlich gab es eine Tastatur und eine Konsole-Schreibmaschine für einfache und begrenzte Eingaben. UNIVAC benutzte ähnlich zu seinen Vorgängern das Dezimalsystem und konnte 7.200 Dezimalziffern pro Sekunde verarbeiten.\n\nTechnische Daten\nFläche: 35.5 Quadratmeter\nGewicht: 13 Tonnen\n5.200 Vakuumröhren\n18.000 Kristall-Dioden\nKosten: 159.000 US-$ bis 1.500.00 US-$\n\n\nQuellen:\nhttps://www.britannica.com/technology/UNIVAC\nhttps://dl.acm.org/doi/epdf/10.5555/1074100.1074889\nhttps://ds.amu.edu.et/xmlui/bitstream/handle/123456789/11722/MIT.Press.A.History.Of.Modern.Computing.2nd.Edition.May.2003.ISBN.0262532034.pdf?sequence=1&isAllowed=y\nhttps://elibrary.ru/item.asp?id=8436093\n",
  "image": "UNIVAC.jpg",
  "connections": ["JOHN_PRESPER_ECKERT", "JOHN_WILLIAM_MAUCHLY", "TURING_MACHINE"]
}