{
  "id": "HTML",
  "title": "Hypertext Markup Language (HTML)",
  "content": "HTML ist eine textbasierte Auszeichnungssprache, die vor allem im Kontext des World Wide Webs verwendet wird. Die erste HTML-Spezifikation wurde von Tim Berners-Lee im Jahre 1992 veröffentlicht. Ziel war es, eine für alle Machines verständliche Sprache für die globale Veröffentlichung von Informationen zu schaffen. Die Standards für HTML werden vom 'World Wide Web Consortium' (W3C) festgelegt. Zusammen mit der 'Web Hypertext Application Technology Working Group' (WHATWG) entwickelt W3C HTML weiter. Die aktuelle Version ist HTML5.\n\nSprachelemente\n1. Dokumenttypdefinition (DTD):  formale Spezifikation, die die Struktur und Syntax von XML-Dokumenten definiert\n2. Dokumenttypdeklarationen: definiert die HTML-Version und referenziert die DTD (ausgenommen HTML5)\n3. Elemente: Repräsentieren Strukturen oder gewünschtes Verhalten. Sie bestehen üblicherweise aus einem Start-Tag (z.B.: \"<HTML>\"), einem End-Tag (z.B.: \"</HTML>\") und einem beliebigen Inhalt. Abhängig von der DTD-Spezifikation kann das End-Tag bei Elementen auch weggelassen werden oder der Inhalt leer sein.\n4. Attribute: Eigenschaften eines Elements, die als Key-Value-Paare vor dem \">\"-Zeichen des jeweiligen Start-Tags stehen\n5. Zeichenreferenzen: numerische oder symbolische Namen für Zeichen. Sie beginnen mit einem \"&\" und enden mit einem Semikolon. Beispiele: \"&lt;\" ist die Zeichenreferenz für  \"<\", \"&gt\" ist die Zeichenreferenz für \">\"\n6. Kommentare: Anmerkungen oder Erläuterungen zum HTML-Code, die nicht interpretiert werden. Sie beginnen mit \"<!--\" und enden mit \"-->\"\n\nTypischer Aufbau\n1. HTML-Dokumente beginnen mit der \"<!DOCTYPE html>\"-Deklaration (HTML5)\n2. Danach folgt der \"<HEAD>\"-Bereich mit Metainformationen wie Titel, Zeichensatz und den Ansichtseinstellungen\n3. Der \"<BODY>\"-Bereich stellt den eigentlichen Inhalt der Webseite dar. Er besteht aus Textelementen, Listen, Verweisen, Formularen und Strukturelementen.\n\nBeispiel (HTML5):\n<!DOCTYPE html>\"\n<HTML>\n    <HEAD>\n        <TITLE>My first HTML document</TITLE>\n        <META http-equiv=\"content-type\"\\\n              content=\"text/html;\\\n              charset=utf-8\"/>\n        <META name=\"viewport\"\\\n              content=\"width=device-width,\\ \n              initial-scale=1.0\"/>\n    </HEAD>\n    <BODY>\n        <HEADER>\n            <H1 id=\"section1\">\n            This is an identified heading thanks to the id attribute\n            </H1>\n        </HEADER>\n        <P>Hello world!\n    </BODY>\n</HTML>\n\nQuellen:\nhttp://homepages.cs.ncl.ac.uk/brian.randell/Seminars/92.pdf\nhttps://www.immagic.com/eLibrary/ARCHIVES/SUPRSDED/W3C/W980424S.pdf\nhttps://html.spec.whatwg.org/multipage/\n",
  "image": "HTML.png",
  "connections": ["TIM_BERNERS_LEE", "WORLD_WIDE_WEB", "WORLD_WIDE_WEB_CONSORTIUM"]
}