{
  "id": "WORLD_WIDE_WEB",
  "title": "World Wide Web (WWW/W3)",
  "content": "Das World Wide Web (abgekürzt auch 'WWW' oder 'W3') ist ein System aus miteinander verknüpften Hypertext-Dokumenten (HTML), die über das Internet abgerufen werden können. Durch das World Wide Web wird der universellen Zugang zu einer Vielzahl von Dokumenten ermöglicht.\n\nKernstandards\n1. Uniform Resource Identifier (URI): eindeutige Bezeichner von Ressourcen, die das Adresssystem bilden\n2. Hypertext Transfer Protocol (HTTP): Netzwerk Protokoll, mit dem Informationen übertragen werden\n3. Hypertext Markup Language (HTML): Auszeichnungssprache, die von jedem W3-Client verstanden wird\n\nEntstehungsgeschichte\nIn den 1980er Jahren kooperierten Wissenschaftler aus verschiedenen Ländern am schweizer Kernforschungszentrum CERN. Aufgrund der Beschränkungen bestehender Informationssysteme auf bestimmte Computerplattformen gestaltete sich der Informationsaustausch als äußerst aufwendig. Mit dem Ziel, einen effizienten Austausch wissenschaftlicher Informationen zu ermöglichen, entwickelte Tim Berners-Lee im Jahr 1989 das Konzept des World Wide Web. Seine Idee basierte auf der Verlinkung von nicht-linearen Informationen mittels Hypertext. Im Gegensatz zu vorherigen Systemen, die oft zentralisiert und an bestimmte Institutionen gebunden waren, eröffnete das WWW jedem Nutzer weltweit den Zugang zu Webseiten und die Möglichkeit zu ihrer Erstellung. Die Verwendung von Hyperlinks vereinfachte die Navigation durch das Web erheblich, da Nutzer von einer Webseite zur anderen springen konnten, um relevante Informationen zu finden. Im Jahr 1990 veröffentlichte Lee den ersten Webserver ('CERN httpd') und den ersten Webbrowser ('WorldWideWeb'), die über das Kommunikationsprotokoll HTTP miteinander kommunizierten. Gleichzeitig legte er HTML als Auszeichnungssprache für das World Wide Web fest. Am 30. April 1993 wurde das World Wide Web kostenlos für die Öffentlichkeit freigegeben, was zu einer explosionsartigen Verbreitung führte.\n\nQuellen:\nhttps://www.w3.org/History/19921103-hypertext/hypertext/WWW/TheProject.html\nhttps://www.w3.org/History/19921103-hypertext/hypertext/WWW/Proposal.html\nhttps://www.w3.org/History/1989/proposal.html\nhttps://dl.acm.org/doi/pdf/10.1145/179606.179671\nhttps://link.springer.com/chapter/10.1007/978-3-8348-2551-3_2\nhttps://books.google.de/books?id=zEHcz259BnUC&pg=PA9&dq=World+Wide+Web+30.+April+1993&hl=de&sa=X&ved=0ahUKEwjc9tztxuLaAhUL3KQKHcOhBMUQ6AEIJzAA#v=onepage&q&f=false\n",
  "image": "WWW.png",
  "connections": []
}